# Column selection, addition, deletion
You can treat a DataFrame semantically like a dict of like-indexed Series objects. Getting, setting, and deleting columns works with the same syntax as the analogous dict operations:

In [98]:
import numpy as np
import pandas as pd

In [99]:
d = { 
    'one': pd.Series([1,2,3,4],index= ['a','b','c','f']),
    'two': pd.Series([4,5,6],index= ['a','b','c']),
    'three': pd.Series([7,8,9,10], index = ['a','b','c','f'])
}

In [100]:
df = pd.DataFrame(d)
df

   one  two  three
a    1  4.0      7
b    2  5.0      8
c    3  6.0      9
f    4  NaN     10

In [101]:
df['one']

a    1
b    2
c    3
f    4
Name: one, dtype: int64

In [102]:
df['three'] = df['one'] * df['three']
df['three']

a     7
b    16
c    27
f    40
Name: three, dtype: int64

## Columns delete or pop

In [103]:
three = df.pop('three')
three

a     7
b    16
c    27
f    40
Name: three, dtype: int64

In [104]:
df

   one  two
a    1  4.0
b    2  5.0
c    3  6.0
f    4  NaN

In [105]:
del df['two']

In [106]:
df

   one
a    1
b    2
c    3
f    4

## Insert

In [107]:
df['foo'] = 'bar'
df

   one  foo
a    1  bar
b    2  bar
c    3  bar
f    4  bar

In [108]:
df['one_trunc'] = df['one'][1:3]
df

   one  foo  one_trunc
a    1  bar        NaN
b    2  bar        2.0
c    3  bar        3.0
f    4  bar        NaN

You can insert raw ndarrays but their length must match the length of the DataFrame’s index.

By default, columns get inserted at the end. The insert function is available to insert at a particular location in the columns:

In [109]:
df.insert(2, 'bar', df['one']) # insert a column look df['one'] at column number 2
df

   one  foo  bar  one_trunc
a    1  bar    1        NaN
b    2  bar    2        2.0
c    3  bar    3        3.0
f    4  bar    4        NaN

In [112]:
df.insert(3,'Five',[5,2,3,4])  #insert acolumn at no 3 named "Four" and the rows is a list
df

   one  foo  bar  Five  Four  one_trunc
a    1  bar    1     5     1        NaN
b    2  bar    2     2     2        2.0
c    3  bar    3     3     3        3.0
f    4  bar    4     4     4        NaN

## Assigning new columns in method chains
Inspired by dplyr’s mutate verb, DataFrame has an assign() method that allows you to easily create new columns that are potentially derived from existing columns.

In [113]:
df = df.assign(ratio_of_one_and_bar=df['one'] / df['bar'])  # insert a new col name ratio_of_one_and_bar 
df

   one  foo  bar  Five  Four  one_trunc  ratio_of_one_and_bar
a    1  bar    1     5     1        NaN                   1.0
b    2  bar    2     2     2        2.0                   1.0
c    3  bar    3     3     3        3.0                   1.0
f    4  bar    4     4     4        NaN                   1.0